const topics = [
  "إيه أول حاجة بتلاحظها في الشخص اللي قدامك؟",
  "لو معاك فرصة تغير اسمك، هتسمي نفسك إيه؟",
  "لو فتحت مطعم، هيكون اسمه إيه؟",
  "لو حياتك فيلم، إيه هيسمّوه؟",
  "إيه أغرب أكلة جربتها؟",
  "هل تحب تسافر بالقطر ولا الطيارة؟ وليه؟",
  "إيه أكتر عادة غريبة عندك؟",
  "لو كان عندك ريموت لحياتك، هتسرّع إيه وتوقف إيه؟",
  "إيه أكتر موقف سخيف حصل لك وانت خارج؟",
  "إيه الحاجة اللي مش ممكن تلبسها حتى لو ببلاش؟",
  "تحب الناس اللي بتضحك طول الوقت؟ ولا الجديين؟",
  "لو رجعت للماضي... هتغير إيه؟",
  "إيه أكتر أكلة بتحبها في الشتاء؟",
  "لو اتبدلت بجارك يوم، هتعمل إيه؟",
  "لو فتحت قناة يوتيوب، هتقدم إيه؟",
  "إيه الحاجة اللي لما بتشوفها بتضحك غصب؟",
  "لو كان في زر يمسح حاجة من ذاكرتك... هتمسح إيه؟",
  "لو عندك 3 أمنيات بس، هتطلب إيه؟ (مفيش حب 😆)",
  "إيه الحاجة اللي كل الناس بتحبها وإنت مش؟",
  "لو صحيت وكنت في جسم نملة، هتعمل إيه؟ 🐜",
  "إيه أغرب كذبة قلتها وأنت صغير؟",
  "هل قابلت حد مشهور قبل كده؟ وإيه حصل؟",
  "إيه أكتر حاجة عملتها على السوشيال ميديا وندمت؟",
  "لو كنت شخصية كرتونية، تبقى مين؟",
  "هل الضحك بيخلينا أقرب من بعض؟ وليه؟",
"إيه أكتر عادة غريبة عند المصريين؟",
"لو فيه زرار يشغل أغنية في أي لحظة... تختار إيه؟",
"إيه أسوأ نصيحة سمعتها في حياتك؟",
"إيه أكتر حاجة بتعملها وانت زهقان؟",
"لو عندك قدرة توقف الوقت، هتعمل إيه؟",
"إيه الحاجة اللي بتحسسك إنك عيل صغير؟",
"تحب الشتا ولا الصيف؟ وليه؟",
"إيه أغرب مكان رحت فيه وندمت؟",
"إيه الحاجة اللي نفسك تجربها ومش لاقي فرصة؟",
"هل بتتكلم وانت نايم؟ حكايات؟",
"إيه أكتر أكلة بتحسسك براحة نفسية؟",
"لو رجعت ليوم معين تعيشه تاني، تختار إمتى؟",
"إيه الحاجة اللي اتعلمتها بعد موقف سخيف؟",
"هل في صوت معين بيزعجك جدًا؟",
"لو مسكوك بتكلم نفسك، تقولهم إيه؟",
"تحب تسافر مع صحابك ولا لوحدك؟",
"إيه الحاجة اللي محدش يقدر يناقشك فيها؟",
"لو تعمل بودكاست، هتتكلم عن إيه؟",
"هل تقدر تعيش من غير سوشيال ميديا؟ ليه؟",
  "إيه الحاجة اللي دايمًا بتضيعها؟"
];
let used = [];
let counter = 0;

function playSound() {
  document.getElementById("sound").play();
}

function getRandomTopic() {
  if (used.length === topics.length) used = [];
  let t;
  do {
    t = topics[Math.floor(Math.random() * topics.length)];
  } while (used.includes(t));
  used.push(t);
  return t;
}

function showTopic() {
  const t = getRandomTopic();
  document.getElementById("cardText").textContent = t;
  counter++;
  document.getElementById("counter").textContent = `عدد التوبيكات: ${counter}`;
  playSound();
}

function toggleTheme() {
  document.getElementById("body").classList.toggle("light-mode");
}