const questions = [
  "لو كنت أكلة، تبقى إيه وليه؟ 🍕",
  "لو في زومبي وراك، مين أول واحد هتزقه عشان تهرب؟ 🧟",
  "هل عمرك أكلت حاجة بعد ما وقعت على الأرض؟ قول الحقيقة! 😅",
  "إيه الحاجة اللي عملتها وقلت لنفسك بعدها: أنا غبي؟ 😂",
  "لو صحيت وكنت كلب، أول حاجة هتعملها؟ 🐶",
  "اعترف: بتغني في الحمام؟ وإيه أكتر أغنية؟ 🎤",
  "لو قدرت تختفي يوم كامل، هتعمل إيه؟ (متكذبش 😏)",
  "إيه أغرب حاجة بحثت عنها في جوجل؟ 😳",
  "هل عندك ضحكة غريبة محدش يعرفها؟ ورينا! 😆",
  "لو كنت حشرة، هتكون إيه؟ وليه؟ 🐞",
  "كم مرة قلت 'هبدأ دايت' وما كملتش؟ 🥲",
  "إيه أسوأ لبس لبسته في حياتك؟ صوّرته؟ 😂",
  "لو حياتك فيلم، هيكون اسمه إيه؟ 🎬",
  "لو اتبدلت بجارك يوم، هتعمل إيه؟ 🏠",
    "مين أول حد دق قلبك له بجد؟",
  "لو بتحب حد ومش عارف تعبرله، هتعمل إيه؟",
  "هل أنت شخص رومانسي؟ ولا بتستخبى ورا الهزار؟",
  "إيه أكتر لحظة رومانسية حصلت في حياتك؟",
  "هل بتحب حد حاليًا ومش قادر تنساه؟",
  "هل ممكن تسامح حبيبك لو غلط فيك؟",
  "إيه الحاجة اللي بتخليك تقع في حب حد؟",
  "لو هتكتب رسالة حب دلوقتي، هتكتب لمين؟",
  "مين أكتر شخص نفسك يكون جنبك دلوقتي؟",
  "هل الحب عندك اختيار ولا قدر؟",
  "إيه أكتر حاجة بتخاف منها من غير سبب؟ 👻",
  "لو عيل صغير ضربك، هترد عليه؟ 🤔",
  "إيه أسوأ كذبة قلتها وانت صغير؟",
"لو كنت حيوان، تبقى إيه؟ وليه؟",
"إيه أكتر أكلة ما بتحبهاش خالص؟",
"لو فتحت قناة يوتيوب، هتسميها إيه؟",
"إيه الحاجة اللي لما بتحصل لك بتحس إنك مش طبيعي؟",
"لو كنت شخصية كرتونية، تبقى مين؟",
"إيه أكتر موقف ضحكت فيه لحد ما دمعت؟",
"إيه أول كلمة بتقولها لما تصحى من النوم؟",
"هل عمرك اتكسفت من نفسك قدام حد؟",
"إيه الحاجة اللي بتخاف تتكلم فيها مع الناس؟",
"لو الناس كلها شافت موبايلك دلوقتي، إيه اللي هتحذفه؟",
"إيه أغبى حاجة عملتها في حياتك؟",
"هل بتحب صوتك في التسجيل؟",
"إيه الكلمة اللي دايمًا تقولها من غير ما تحس؟",
"إيه أكتر حاجة بتخليك تعصب؟",
"إيه أغرب عادة عندك محدش يعرفها؟",
"هل جربت تبعت رسالة بالغلط لشخص غلط؟",
"لو فتحت محل، هيكون بيبيع إيه؟",
"إيه أول حاجة بتعملها لما تقفل موبايلك؟",
"لو طلعت في التلفزيون فجأة، هتقول إيه؟",
  "اعترف: بتتكلم مع نفسك أحيانًا؟ وإيه بتقول؟ 🗣️",
  "لو كنت سوبر ماريو، هتنقذ الأميرة ولا تاخد الفطر وتهرب؟ 🍄👸",
  "إيه أول كلمة بتقولها لما تصحى من النوم؟ 😴",
  "لو كنت جهاز كهربائي، تبقى إيه؟ ولمين؟ 🔌"
];

let used = [];
let counter = 0;

function playSound() {
  document.getElementById("sound").play();
}

function getRandomQuestion() {
  if (used.length === questions.length) used = [];
  let q;
  do {
    q = questions[Math.floor(Math.random() * questions.length)];
  } while (used.includes(q));
  used.push(q);
  return q;
}

function showQuestion() {
  const q = getRandomQuestion();
  document.getElementById("cardText").textContent = q;
  counter++;
  document.getElementById("counter").textContent = `عدد الأسئلة: ${counter}`;
  playSound();
}

function toggleTheme() {
  document.getElementById("body").classList.toggle("light-mode");
}
